
/*! \mainpage OTUS-CPP-Professional-HomeWork_6 (Проект 2-мерной разреженной матрицы)
 *  \n При разаработке 2-мерной разреженной матрицы пригодились слежующие материалы
 *  \n Книги:
 *  \n Андрианова А.А. Имсагилов Л.Н. Мухтарова Т.М. "Объектно-ориентрованное программирование на С++" 2010г.
 *  \n \n 
 *	\n Полезные ссылки:
 *  \n - Двумерные динамические массивы
 *	\n https://code-live.ru/post/cpp-array-tutorial-part-2/
 *  \n https://habr.com/ru/post/495444/
 *  \n https://youtu.be/UhiG8c7hmIA
 *	\n 
 *	\n - Прокси класс и перегрузка оператора []
 *  \n https://overcoder.net/q/72554/%D1%87%D1%82%D0%BE-%D1%82%D0%B0%D0%BA%D0%BE%D0%B5-%D0%BF%D1%80%D0%BE%D0%BA%D1%81%D0%B8-%D0%BA%D0%BB%D0%B0%D1%81%D1%81-%D0%B2-c
 *
 */